<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Description</key>
  <string>Downloads the current release version of JetBrains Gateway and imports into Munki.</string>
  <key>Identifier</key>
  <string>io.github.chefaustin.munki.JetBrainsGateway</string>
  <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>JetBrains Gateway</string>
    <key>MUNKI_REPO_SUBDIR</key>
    <string>applications/JetBrains/Gateway</string>
    <key>MUNKI_CATEGORY</key>
    <string>Developer Tools</string>
    <key>pkginfo</key>
    <dict>
      <key>catalogs</key>
      <array>
        <string>alpha</string>
      </array>
      <key>category</key>
      <string>%MUNKI_CATEGORY%</string>
      <key>description</key>
      <string>JetBrains Gateway is used as an entry point to connect to a remote server via SSH. It launches JetBrains Client, which is a thin client that enables you to work with your remote project.</string>
      <key>developer</key>
      <string>JetBrains</string>
      <key>display_name</key>
      <string>JetBrains Gateway</string>
      <key>name</key>
      <string>%NAME%</string>
      <key>unattended_install</key>
      <true/>
      <key>unattended_uninstall</key>
      <true/>
    </dict>
  </dict>
  <key>MinimumVersion</key>
  <string>0.2.9</string>
  <key>ParentRecipe</key>
  <string>io.github.chefaustin.download.JetBrainsGateway</string>
  <key>Process</key>
  <array>
    <dict>
      <key>Processor</key>
      <string>MunkiImporter</string>
      <key>Arguments</key>
      <dict>
        <key>munkiimport_appname</key>
        <string>JetBrains Gateway.app</string>
        <key>pkg_path</key>
        <string>%pathname%</string>
        <key>repo_subdirectory</key>
        <string>%MUNKI_REPO_SUBDIR%</string>
      </dict>
    </dict>
  </array>
</dict>
</plist>